[Killed] StringLiteral
sd-015-b-project-react-testing-library/src/components/PokemonDetails.js:13:14
   static renderHabitat({ foundAt, name }) {
     return (
       <section>
-        <h2>{`Game Locations of ` + `${name}`}</h2>
+        <h2>{"" + `${name}`}</h2>
         <div className="pokemon-habitat">
           {foundAt.map(({ location, map }) => (

[Killed] StringLiteral
sd-015-b-project-react-testing-library/src/components/PokemonDetails.js:80:35
 
     return (
       <section className="pokemon-details">
-        <h2>{`${pokemon.name} ` + `Details`}</h2>
+        <h2>{`${pokemon.name} ` + ""}</h2>
         <Pokemon
           pokemon={pokemon}
